turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LS8A.atdf
        <register name="PVR" offset="0x60" rw="R" size="4" access-size="4" caption="Pin Value Register">
          <bitfield name="P0" caption="Pin Value" mask="0x1"/>
          <bitfield name="P1" caption="Pin Value" mask="0x2"/>
          <bitfield name="P2" caption="Pin Value" mask="0x4"/>
          <bitfield name="P3" caption="Pin Value" mask="0x8"/>
          <bitfield name="P4" caption="Pin Value" mask="0x10"/>
          <bitfield name="P5" caption="Pin Value" mask="0x20"/>
          <bitfield name="P6" caption="Pin Value" mask="0x40"/>
          <bitfield name="P7" caption="Pin Value" mask="0x80"/>
          <bitfield name="P8" caption="Pin Value" mask="0x100"/>
          <bitfield name="P9" caption="Pin Value" mask="0x200"/>
          <bitfield name="P10" caption="Pin Value" mask="0x400"/>
          <bitfield name="P11" caption="Pin Value" mask="0x800"/>
          <bitfield name="P12" caption="Pin Value" mask="0x1000"/>
          <bitfield name="P13" caption="Pin Value" mask="0x2000"/>
          <bitfield name="P14" caption="Pin Value" mask="0x4000"/>
          <bitfield name="P15" caption="Pin Value" mask="0x8000"/>
          <bitfield name="P16" caption="Pin Value" mask="0x10000"/>
          <bitfield name="P17" caption="Pin Value" mask="0x20000"/>
          <bitfield name="P18" caption="Pin Value" mask="0x40000"/>
          <bitfield name="P19" caption="Pin Value" mask="0x80000"/>
          <bitfield name="P20" caption="Pin Value" mask="0x100000"/>
          <bitfield name="P21" caption="Pin Value" mask="0x200000"/>
          <bitfield name="P22" caption="Pin Value" mask="0x400000"/>
          <bitfield name="P23" caption="Pin Value" mask="0x800000"/>
          <bitfield name="P24" caption="Pin Value" mask="0x1000000"/>
          <bitfield name="P25" caption="Pin Value" mask="0x2000000"/>
          <bitfield name="P26" caption="Pin Value" mask="0x4000000"/>
          <bitfield name="P27" caption="Pin Value" mask="0x8000000"/>
          <bitfield name="P28" caption="Pin Value" mask="0x10000000"/>
          <bitfield name="P29" caption="Pin Value" mask="0x20000000"/>
          <bitfield name="P30" caption="Pin Value" mask="0x40000000"/>
          <bitfield name="P31" caption="Pin Value" mask="0x80000000"/>
        </register>
        <register name="PUER" offset="0x70" rw="RW" size="4" access-size="4" caption="Pull-up Enable Register">
          <bitfield name="P0" caption="Pull-up Enable" mask="0x1"/>
          <bitfield name="P1" caption="Pull-up Enable" mask="0x2"/>
          <bitfield name="P2" caption="Pull-up Enable" mask="0x4"/>
          <bitfield name="P3" caption="Pull-up Enable" mask="0x8"/>
          <bitfield name="P4" caption="Pull-up Enable" mask="0x10"/>
          <bitfield name="P5" caption="Pull-up Enable" mask="0x20"/>
          <bitfield name="P6" caption="Pull-up Enable" mask="0x40"/>
          <bitfield name="P7" caption="Pull-up Enable" mask="0x80"/>
          <bitfield name="P8" caption="Pull-up Enable" mask="0x100"/>
          <bitfield name="P9" caption="Pull-up Enable" mask="0x200"/>
          <bitfield name="P10" caption="Pull-up Enable" mask="0x400"/>
          <bitfield name="P11" caption="Pull-up Enable" mask="0x800"/>
          <bitfield name="P12" caption="Pull-up Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Pull-up Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Pull-up Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Pull-up Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Pull-up Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Pull-up Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Pull-up Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Pull-up Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Pull-up Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Pull-up Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Pull-up Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Pull-up Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Pull-up Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Pull-up Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Pull-up Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Pull-up Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Pull-up Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Pull-up Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Pull-up Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Pull-up Enable" mask="0x80000000"/>
        </register>
        <register name="PUERS" offset="0x74" rw="W" size="4" access-size="4" atomic-op="set:PUER" caption="Pull-up Enable Register - Set">
          <bitfield name="P0" caption="Pull-up Enable" mask="0x1"/>
          <bitfield name="P1" caption="Pull-up Enable" mask="0x2"/>
          <bitfield name="P2" caption="Pull-up Enable" mask="0x4"/>
          <bitfield name="P3" caption="Pull-up Enable" mask="0x8"/>
          <bitfield name="P4" caption="Pull-up Enable" mask="0x10"/>
          <bitfield name="P5" caption="Pull-up Enable" mask="0x20"/>
          <bitfield name="P6" caption="Pull-up Enable" mask="0x40"/>
          <bitfield name="P7" caption="Pull-up Enable" mask="0x80"/>
          <bitfield name="P8" caption="Pull-up Enable" mask="0x100"/>
          <bitfield name="P9" caption="Pull-up Enable" mask="0x200"/>
          <bitfield name="P10" caption="Pull-up Enable" mask="0x400"/>
          <bitfield name="P11" caption="Pull-up Enable" mask="0x800"/>
          <bitfield name="P12" caption="Pull-up Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Pull-up Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Pull-up Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Pull-up Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Pull-up Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Pull-up Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Pull-up Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Pull-up Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Pull-up Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Pull-up Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Pull-up Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Pull-up Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Pull-up Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Pull-up Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Pull-up Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Pull-up Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Pull-up Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Pull-up Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Pull-up Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Pull-up Enable" mask="0x80000000"/>
        </register>
        <register name="PUERC" offset="0x78" rw="W" size="4" access-size="4" atomic-op="clear:PUER" caption="Pull-up Enable Register - Clear">
          <bitfield name="P0" caption="Pull-up Enable" mask="0x1"/>
          <bitfield name="P1" caption="Pull-up Enable" mask="0x2"/>
          <bitfield name="P2" caption="Pull-up Enable" mask="0x4"/>
          <bitfield name="P3" caption="Pull-up Enable" mask="0x8"/>
          <bitfield name="P4" caption="Pull-up Enable" mask="0x10"/>
          <bitfield name="P5" caption="Pull-up Enable" mask="0x20"/>
          <bitfield name="P6" caption="Pull-up Enable" mask="0x40"/>
          <bitfield name="P7" caption="Pull-up Enable" mask="0x80"/>
          <bitfield name="P8" caption="Pull-up Enable" mask="0x100"/>
          <bitfield name="P9" caption="Pull-up Enable" mask="0x200"/>
          <bitfield name="P10" caption="Pull-up Enable" mask="0x400"/>
          <bitfield name="P11" caption="Pull-up Enable" mask="0x800"/>
          <bitfield name="P12" caption="Pull-up Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Pull-up Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Pull-up Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Pull-up Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Pull-up Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Pull-up Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Pull-up Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Pull-up Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Pull-up Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Pull-up Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Pull-up Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Pull-up Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Pull-up Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Pull-up Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Pull-up Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Pull-up Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Pull-up Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Pull-up Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Pull-up Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Pull-up Enable" mask="0x80000000"/>
        </register>
        <register name="PUERT" offset="0x7C" rw="W" size="4" access-size="4" atomic-op="toggle:PUER" caption="Pull-up Enable Register - Toggle">
          <bitfield name="P0" caption="Pull-up Enable" mask="0x1"/>
          <bitfield name="P1" caption="Pull-up Enable" mask="0x2"/>
          <bitfield name="P2" caption="Pull-up Enable" mask="0x4"/>
          <bitfield name="P3" caption="Pull-up Enable" mask="0x8"/>
          <bitfield name="P4" caption="Pull-up Enable" mask="0x10"/>
          <bitfield name="P5" caption="Pull-up Enable" mask="0x20"/>
          <bitfield name="P6" caption="Pull-up Enable" mask="0x40"/>
          <bitfield name="P7" caption="Pull-up Enable" mask="0x80"/>
          <bitfield name="P8" caption="Pull-up Enable" mask="0x100"/>
          <bitfield name="P9" caption="Pull-up Enable" mask="0x200"/>
          <bitfield name="P10" caption="Pull-up Enable" mask="0x400"/>
          <bitfield name="P11" caption="Pull-up Enable" mask="0x800"/>
          <bitfield name="P12" caption="Pull-up Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Pull-up Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Pull-up Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Pull-up Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Pull-up Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Pull-up Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Pull-up Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Pull-up Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Pull-up Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Pull-up Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Pull-up Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Pull-up Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Pull-up Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Pull-up Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Pull-up Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Pull-up Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Pull-up Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Pull-up Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Pull-up Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Pull-up Enable" mask="0x80000000"/>
        </register>
        <register name="PDER" offset="0x80" rw="RW" size="4" access-size="4" caption="Pull-down Enable Register">
          <bitfield name="P0" caption="Pull-down Enable" mask="0x1"/>
          <bitfield name="P1" caption="Pull-down Enable" mask="0x2"/>
          <bitfield name="P2" caption="Pull-down Enable" mask="0x4"/>
          <bitfield name="P3" caption="Pull-down Enable" mask="0x8"/>
          <bitfield name="P4" caption="Pull-down Enable" mask="0x10"/>
          <bitfield name="P5" caption="Pull-down Enable" mask="0x20"/>
          <bitfield name="P6" caption="Pull-down Enable" mask="0x40"/>
          <bitfield name="P7" caption="Pull-down Enable" mask="0x80"/>
          <bitfield name="P8" caption="Pull-down Enable" mask="0x100"/>
          <bitfield name="P9" caption="Pull-down Enable" mask="0x200"/>
          <bitfield name="P10" caption="Pull-down Enable" mask="0x400"/>
          <bitfield name="P11" caption="Pull-down Enable" mask="0x800"/>
          <bitfield name="P12" caption="Pull-down Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Pull-down Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Pull-down Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Pull-down Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Pull-down Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Pull-down Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Pull-down Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Pull-down Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Pull-down Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Pull-down Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Pull-down Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Pull-down Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Pull-down Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Pull-down Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Pull-down Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Pull-down Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Pull-down Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Pull-down Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Pull-down Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Pull-down Enable" mask="0x80000000"/>
        </register>
